---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.IndexStreamPoint
source: html/b2ab0423-2e31-d5a2-ef70-197ca1bf9687.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexStreamPoint

A stream that can be used to write IndexPoint
 primitives into an IndexBuffer

## Syntax (C#)
```csharp
public class IndexStreamPoint : IndexStream
```